PYTHON_STEPS/outputs/output_03_20251123_153004/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|h|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    age
    {
        $U;
        relTol          0.001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    consistent          yes;
    pRefCell            0;
    pRefValue           0;
    
    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;
    }
}

relaxationFactors
{
    fields
    {
        rho             0.05;  // VERY conservative for diagnostic (Nov 4, 2025)
        p_rgh           0.1;   // Drastically reduced for stability analysis
        p_rghFinal      0.1;
    }
    equations
    {
        U               0.1;   // Drastically reduced for stability analysis
        h               0.2;   // Drastically reduced for stability analysis
        "(k|epsilon|omega)" 0.2;
        UFinal          0.3;
    }
}


// ************************************************************************* //
