PYTHON_STEPS/outputs/output_03_20251123_153004/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Author: Franjo Juretic                          | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "geometry.stl";

// CRITICAL: Enforce geometry constraint - cfMesh MUST respect the STL surface
enforceGeometry 1;

// CRITICAL: Keep cells intersecting boundary to mesh INTERIOR (not exterior)
// This is essential for HVAC internal flow simulations
keepCellsIntersectingBoundary 1;

// Check for glued mesh to fix gaps
checkForGluedMesh 1;

maxCellSize 0.100000;

// Uniform mesh - no boundary layer refinement for testing
// Using fixed cell size throughout the domain
boundaryCellSize 0.100000;

// Minimum cell size allowed
minCellSize 0.100000;

// Reproject surface points for better geometry capture
renameBoundary
{
    defaultName        walls;
    defaultType        wall;
}

// Quality settings for mesh optimization
meshQualitySettings
{
    // Maximum non-orthogonality angle (degrees)
    // Lower is better, 65 is acceptable for CFD
    maxNonOrthogonality 65;
    
    // Maximum boundary skewness
    maxBoundarySkewness 20;
    
    // Maximum internal skewness
    maxInternalSkewness 4;
    
    // Minimum cell volume (cubic meters)
    minCellVolume 1e-13;
    
    // Minimum face area
    minFaceArea 1e-13;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
